       IDENTIFICATION DIVISION.
       PROGRAM-ID. MASTER-MENU.
       AUTHOR JOHN CHIRPICH.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 MENU-SEL PIC 9.
       01 KEY-STATUS PIC 9999. 
       01 WS-RETURN pic 9.
       PROCEDURE DIVISION.
        MASTER-MENU.
                CALL 'ADD-CAMPER' RETURNING WS-RETURN
                DISPLAY 'FILLER'
                STOP RUN.
