       IDENTIFICATION DIVISION.
       PROGRAM-ID. 300-ADD-CAMPER.
       AUTHOR. JOHN CHIRPICH.
       DATE-WRITTEN. 10-17-2024.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           CRT STATUS IS KEY-STATUS.
       SOURCE-COMPUTER. X86.
       INPUT-OUTPUT SECTION.
           FILE-CONTROL.
           SELECT FC-CAMPERS ASSIGN TO './db/campers.dat'
           ORGANIZATION IS INDEXED
           ACCESS MODE IS DYNAMIC
           RECORD KEY IS FD-CAMPER-TROOP.

       DATA DIVISION.
       FILE SECTION.
       FD FC-CAMPERS.
       01 FD-CAMPER.
          88 EOF VALUE HIGH-VALUE.
           02 FD-CAMPER-TROOP.
                03 FD-CAMPER-AREA PIC 9.
                03 FD-CAMPER-UNIT PIC 999.
           02 FD-SIGNED-UP.
                03 FD-ADULTS PIC 99.
                03 FD-YOUTH PIC 99.
           02 FD-ACTUAL.
                03 FD-ACTAUL-ADULTS PIC 99.
                03 FD-ACTUAL-YOUTH PIC 99.
       WORKING-STORAGE SECTION.
       01 KEY-STATUS PIC 9999.
       01 WS-CAMPER.
           02 WS-CAMPER-TROOP.
                03 WS-CAMPER-AREA PIC 9.
                03 WS-CAMPER-ID PIC 999.
           02 WS-SIGNED-UP.
                03 WS-CAMPER-ADULTS PIC 99.
                03 WS-CAMPER-YOUTH PIC 99.
       01 WS-MSG PIC X(80).
       01 WS-EXIT-COUNTER PIC 9.
       SCREEN SECTION.
       01 CLEAR-SCREEN.
          05 BLANK SCREEN.
       01 SS-CAMPER-DATA-ENTRY.
          05 LINE 1 COL 35 VALUE IS "CAMPER ENTRY".
           05 LINE 12 COL 2 VALUE IS "TROOP#: ".
           05 PIC 9999 USING WS-CAMPER-TROOP.
           05 LINE 13 COL 2 VALUE IS "ADULTS: ".
           05 PIC 99 USING WS-CAMPER-ADULTS.
           05 LINE 14 COL 2 VALUE IS "YOUTH: ".
           05 PIC 99 USING WS-CAMPER-YOUTH.
           05 LINE 23 COL 1 VALUE IS "F3: EXIT F9: PROCESS".
       01 SS-MESSAGE.
           05 LINE 24 COL 1 PIC X(80) USING WS-MSG.

       PROCEDURE DIVISION.
       300-ADD-CAMPER.
           DISPLAY CLEAR-SCREEN
           DISPLAY SS-MESSAGE
           DISPLAY SS-CAMPER-DATA-ENTRY
           ACCEPT SS-CAMPER-DATA-ENTRY
           MOVE SPACES TO WS-MSG
                IF KEY-STATUS = 1009 OR KEY-STATUS = 0000
                        MOVE 0 TO WS-EXIT-COUNTER
                        PERFORM 301-ADD-TO-DB
                END-IF
                IF KEY-STATUS = 1003
                        EVALUATE WS-CAMPER-TROOP
                        WHEN ZEROS 
                         EXIT PROGRAM 
           WHEN NUMERIC PERFORM 301-CLEAR-CAMPER-DATA-ENTRY
                       
                END-IF
           PERFORM 300-ADD-CAMPER.
       301-CLEAR-CAMPER-DATA-ENTRY.
           MOVE ZEROS TO WS-CAMPER-ADULTS
           MOVE ZEROS TO WS-CAMPER-YOUTH
           MOVE ZEROS TO WS-CAMPER-TROOP.
       301-ADD-TO-DB.
           OPEN I-O FC-CAMPERS
           MOVE WS-CAMPER-TROOP TO FD-CAMPER-TROOP
           MOVE WS-CAMPER-ADULTS TO FD-ADULTS
           MOVE WS-CAMPER-YOUTH TO FD-YOUTH
           WRITE FD-CAMPER WITH LOCK
           INVALID KEY MOVE "TROOP ALREADY EXISTS" TO WS-MSG
           NOT INVALID KEY MOVE "TROOP ADDED" TO WS-MSG
           END-WRITE
           CLOSE FC-CAMPERS
           PERFORM 301-CLEAR-CAMPER-DATA-ENTRY
           PERFORM 300-ADD-CAMPER.

